/*******************************************************************************
**  ファイル名  ：ColorJudgement.c
**  概要        ：
**  詳細        ：
*******************************************************************************/

#include "ColorJudgement.h"
#define LIGHT_BLACK  560	// 黒色の光センサ値


/*------------------------------------------------------------------------------
--  関数名      ：ColorJudgement_init
--  概要        ：色判定を初期化する。
--              ：
--  引数        ：なし
--  戻り値      ：なし
------------------------------------------------------------------------------*/
void ColorJudgement_init(ColorJudgement* this){
	this->threshold = LIGHT_BLACK;
}


/*------------------------------------------------------------------------------
--  関数名      ：ColorJudgement_main
--  概要        ：色判定する。
--              ：
--  引数        ：なし
--  戻り値      ：COLOR
------------------------------------------------------------------------------*/
COLOR ColorJudgement_judgeColor(ColorJudgement* this){
	// 光センサからの取得値を見て
	// 黒以上であれば「黒」を、
	// そうでなければ「黒以外」を返す
	if(LightSensor_getBrightness(this->lightSensor) >= this->threshold){
		return  BLACK;
	}
	return NON_BLACK;
} 

