/*******************************************************************************
**  ファイル名  ：Dash.c
**  概要        ：ダッシュ
**  詳細        ：直線でダッシュする。
*******************************************************************************/

#include "Dash.h"


/*------------------------------------------------------------------------------
--  関数名      ：Dash_init
--  概要        ：ダッシュ部品の初期化をする。
--              ：
--  引数        ：なし
--  戻り値      ：なし
------------------------------------------------------------------------------*/
void Dash_init(Dash* this)
{
		this->counter = 0;				//カウンタ
}



/*------------------------------------------------------------------------------
--  関数名      ：Dash_action
--  概要        ：ダッシュのメイン処理。
--              ：
--  引数        ：upvol：オフセット値を一気に上げる量
--                uplim：オフセット値を一気に上げる間隔
--  戻り値      ：なし
------------------------------------------------------------------------------*/
void Dash_action(Dash* this, Info *info , int upvol, int uplim)
{
	if(this->counter == 0){
		//オフセット値を高くする
		info->runnerInfo->gyroOffset = info->runnerInfo->gyroOffset + upvol;
		ecrobot_sound_tone(400, 100, 95);

		//カウントアップ
		this->counter = this->counter + 1;
	}
}
