/*******************************************************************************
**  ファイル名  ：SonarSensor.c
**  概要        ：超音波センサクラス
**  詳細        ：超音波センサに関する処理を行う。
*******************************************************************************/

#include "SonarSensor.h"

/*------------------------------------------------------------------------------
--  関数名      ：SonarSensor_Init
--  概要        ：超音波センサの初期化を行う。
--              ：nxtOSEKが提供しているデバイス初期化用フック関数内で必ず呼び出す
--              ：こと。
--  引数        ：なし
--  戻り値      ：なし
------------------------------------------------------------------------------*/
void SonarSensor_init(SonarSensor* this, SENSOR_PORT_T inputPort)
{
	this->inputPort = inputPort;
	ecrobot_init_sonar_sensor(this->inputPort);
}

/*------------------------------------------------------------------------------
--  関数名      ：SonarSensor_Get
--  概要        ：超音波センサ計測距離データの取得する。
--              ：超音波測定時にエコーが返ってこない場合の測定データは255となる。
--  引数        ：なし
--  戻り値      ：S32			計測距離データ[cm]。
--              ：				超音波測定時にエコーが返ってこない場合は255を返す。
------------------------------------------------------------------------------*/
S32 SonarSensor_get(SonarSensor* this)
{
    // 戻り値は、-1～255
	return ecrobot_get_sonar_sensor(this->inputPort);
}

/*------------------------------------------------------------------------------
--  関数名      ：SonarSensor_Term
--  概要        ：超音波センサの終了処理を行う。
--              ：nxtOSEKが提供しているデバイス終了用フック関数内で必ず呼び出す
--              ：こと。
--  引数        ：なし
--  戻り値      ：なし
------------------------------------------------------------------------------*/
void SonarSensor_term(SonarSensor* this)
{
	// 超音波センサのI2C通信用設定を解除
	ecrobot_term_sonar_sensor(this->inputPort);
	return;
}
