/*******************************************************************************
**  ファイル名  ：Order.c
**  概要        ：
**  詳細        ：
*******************************************************************************/

#include "Order.h"



/*------------------------------------------------------------------------------
--  関数名      ：Order_init
--  概要        ：初期化する。
--              ：
--  引数        ：なし
--  戻り値      ：なし
------------------------------------------------------------------------------*/
void Order_init(Order* this)
{
	this->type = ORDER_TYPE_NONE;
	this->value1 = 0;
	this->value2 = 0;
	this->value3 = 0;
	this->finishTime = 0;
	this->finishValue = 0;
	this->isFinished = FALSE;
}
